In [1]:
import pandas as pd

In [7]:
titanic = pd.read_csv("C:\\Users\\jimmy15923\\Desktop\\titanic_data.csv")
#read the csv file

In [12]:
titanic.head()
#use head function to overview the data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
titanic.groupby("Survived")

In [151]:
titanic.groupby("Survived")[["Age","Fare"]].mean()
# see the mean age and fare of survival or not

                Age       Fare
Survived
0         30.626179  22.117887
1         28.343690  48.395408

In [28]:
titanic.describe()
# descriptive statistics for data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [24]:
print(titanic["Age"])
# find many missing value in "age" column

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5       NaN
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      NaN
18     31.0
19      NaN
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26      NaN
27     19.0
28      NaN
29      NaN
       ...
861    21.0
862    48.0
863     NaN
864    24.0
865    42.0
866    27.0
867    31.0
868     NaN
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878     NaN
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, dtype: float64

In [29]:
nan = pd.isnull(titanic["Age"])
#boolean sereis on NaN value

In [32]:
len(nan[nan == True])
#number of missing value in Age column

177

In [377]:
plt.title("Distribution of Age")
plt.xlabel("Age")
plt.ylabel("Counts")
titanic['Age'].hist(bins=50)
plt.show()

In [374]:
titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [460]:
fig, axis1 = plt.subplots(1,1,figsize=(18,4))
#the age was float, which make the xlabe unreadable. So change it to int
titanic['newAge'] = titanic['Age'].fillna(value = 29.6).astype(int)
#fill in the average age to null value
average_age = titanic[["newAge", "Survived"]].groupby(['newAge'],as_index=False).mean()
sns.barplot(x='newAge', y='Survived', data=average_age)
plt.show()

In [372]:
plt.title("Distribution of Fare")
titanic['Fare'].hist(bins=50)
plt.show()

In [368]:
import seaborn as sns
sns.countplot(x='Embarked', data=titanic)
plt.show()

In [369]:
sns.countplot(x='Fare', data=titanic)
plt.show()

In [ ]:
sns.countplot(x='Survived', data=titanic)
plt.show()

In [370]:
sns.countplot(x='Pclass', data=titanic)
plt.show()

In [33]:
def nan_count(column):
    column_null = pd.isnull(column)
    null = column[column_null==True]
    return len(null)
titanic.apply(nan_count)

#write a function to check all missing values in all column
#most missing values are in the "cabin" column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#We can see the dataset to check if women and children have the higher probabilities to survive.

In [60]:
def age_series(df):
    age = df["Age"]
    if pd.isnull(age):
        return "NaN"
    elif age < 18:
        return "children"
    else:
        return "adult"
age_series = titanic.apply(age_series, axis = 1)
#this function use the age column to create a series contain "adult", "children", "NaN". which could easily see the number of children and adult

In [145]:
adult_num = len(age_series[age_series =="adult"])
children_num = len(age_series[age_series =="children"])

In [64]:
children_num
#113 children

113

In [42]:
adult_num
#601 adult

601

In [66]:
titanic["age_range"] = age_series
#add new column to titanic dataframe

In [146]:
titanic.groupby("age_range")["Survived"].mean()
#to see the survived probabilities between adult and children

age_range
NaN         0.293785
adult       0.381032
children    0.539823
Name: Survived, dtype: float64

In [474]:
titanic.groupby(("age_range","Pclass"))["Survived"].mean()
#to see whether different Pclass affect survived probabilities between adult and children

age_range  Pclass
NaN        1         0.466667
           2         0.363636
           3         0.250000
adult      1         0.637931
           2         0.413333
           3         0.202166
children   1         0.916667
           2         0.913043
           3         0.371795
Name: Survived, dtype: float64

ValueError: sharex [3] must be one of [u'all', u'row', u'col', u'none']

In [544]:
def age_count_plot(age, hue):
    data = titanic[titanic["age_range"] == age]
    plt.title(age+"_"+"counts")
    sns.countplot(x='Survived', hue=hue, data=data, order=[0,1])
    return plt.show()

In [528]:
age_count_plot("adult","Pclass")

In [529]:
age_count_plot("NaN","Pclass")

In [546]:
age_count_plot("children","Sex")

In [547]:
age_count_plot("adult","Sex")

In [548]:
age_count_plot("NaN","Sex")

In [585]:
a = titanic[titanic["age_range"] == "children"]
b = a[a["Sex"]=="female"]
len(b)

55

In [586]:
len(b[b["Survived"]==1])

38

In [153]:
titanic.groupby(("age_range","Embarked"))["Survived"].mean()
#to see whether different Embarked affect survived probabilities between adult and children

age_range  Embarked
NaN        C           0.368421
           Q           0.448980
           S           0.177778
adult      C           0.575472
           Q           0.238095
           S           0.341102
children   C           0.750000
           Q           0.428571
           S           0.487805
Name: Survived, dtype: float64

In [174]:
titanic[titanic["age_range"] == "children"][titanic["Survived"] == 0][titanic["Pclass"] == 1]

C:\Users\jimmy15923\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  if __name__ == '__main__':

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_range
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.55,C22 C26,S,children

In [148]:
titanic.groupby(("age_range","Sex"))["Survived"].mean()
#to see whether different Sex affect survived probabilities between adult and children

age_range  Sex
NaN        female    0.679245
           male      0.129032
adult      female    0.771845
           male      0.177215
children   female    0.690909
           male      0.396552
Name: Survived, dtype: float64

In [54]:
titanic.groupby("Pclass")["Fare","Age","Survived"].mean()
#to see the differences between pclass

             Fare        Age  Survived
Pclass
1       84.154687  38.233441  0.629630
2       20.662183  29.877630  0.472826
3       13.675550  25.140620  0.242363

In [144]:
titanic.groupby("Pclass")["Fare"].max()
#the max fare in differnt Pclass

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

In [200]:
titanic.groupby("Pclass")["Fare"].min()
#the min fare in differnt Pclass

Pclass
1    0.0
2    0.0
3    0.0
Name: Fare, dtype: float64

In [58]:
titanic[titanic["Fare"] == 0]
#there are 15 people who paid nothing for the fare and all are male, all from Embarked "S". Sadly, only one survived.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_range
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S,adult
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S,adult
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S,adult
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S,NaN
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,adult
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S,NaN
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S,NaN
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S,NaN
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,adult
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S,NaN
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S,NaN
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S,NaN
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S,adult
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S,NaN
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S,adult

In [198]:
def find_name(name):
    df = titanic["Name"][titanic["Survived"] == 1]

    if len(df[df.str.contains(name, flags=re.IGNORECASE)])>0:
        return df[df.str.contains(name, flags=re.IGNORECASE)]
    else:
        return "Sorry! not found"
            

find_name("Jimmy")
#function to search the survivals

'Sorry! not found'

In [202]:
find_name("Rose")
#we find Rosen

855    Aks, Mrs. Sam (Leah Rosen)
Name: Name, dtype: object

In [141]:
titanic["Name"][titanic["Survived"] == 1]
len(titanic["Name"][titanic["Survived"] == 1])
#all survived people

342

In [235]:
import matplotlib.pyplot as plt
size = titanic["Survived"]
plt.scatter(titanic["Fare"],titanic["Age"],s = size*50)
plt.xlabel('Fare')
plt.ylabel("Age")
plt.title("Age and Fare of Survivals")
plt.show()
#Graph about age and fare

In [207]:
titanic.corr()
#correlation of all row and column in titanic

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [342]:
class_survive = titanic.groupby(("Pclass","Sex"),as_index = False)["Survived"].mean()

In [339]:
import numpy as np
male_survive = np.array(class_survive[class_survive["Sex"]=="male"]["Survived"])
female_survive = np.array(class_survive[class_survive["Sex"]=="female"]["Survived"])
group = np.array(class_survive["Pclass"])
#make out dataset to array
#seperate them to male, female ,pclass

In [343]:

n_groups = 3
fig, ax = plt.subplots()
index = np.arange(n_groups)
bar_width = 0.35
opacity = 0.4
error_config = {'ecolor': '0.3'}
rects1 = plt.bar(index, male_survive, bar_width,
                 alpha=opacity,
                 color='b',                
                 error_kw=error_config,
                 label='Male')

rects2 = plt.bar(index + bar_width, female_survive, bar_width,
                 alpha=opacity,
                 color='r',                 
                 error_kw=error_config,
                 label='Female')

plt.xlabel('Pclass')
plt.ylabel('Survived')
plt.title('Survived by Pclass and Sex')
plt.xticks(index + bar_width, ('1', '2', '3'))
plt.legend()

plt.tight_layout()
plt.show()

In [610]:
class_1 = titanic[titanic["Pclass"]==1]
class_other = titanic[titanic["Pclass"]!=1]
n = len(titanic)
std = titanic["Survived"].std()

In [611]:
import numpy as np
Z = (class_1["Survived"].mean() - class_other["Survived"].mean())/ (std/np.sqrt(n))

In [612]:
Z

19.902783742236881

In [616]:
import scipy
f_obs = titanic["Pclass"]
f_exp = titanic["Survived"]

In [620]:
scipy.stats.chisquare(f_obs,f_exp)

Power_divergenceResult(statistic=inf, pvalue=0.0)